### [ env/poc ] terraform plan
```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # helm_release.argocd will be updated in-place
  ~ resource "helm_release" "argocd" {
      ~ id                         = "faspo-poc-argocd" -> (known after apply)
      ~ metadata                   = {
          ~ app_version    = "v2.14.9" -> (known after apply)
          ~ chart          = "argo-cd" -> (known after apply)
          ~ first_deployed = 1744026707 -> (known after apply)
          ~ last_deployed  = 1744026707 -> (known after apply)
          ~ name           = "faspo-poc-argocd" -> (known after apply)
          ~ namespace      = "faspo-poc-argocd" -> (known after apply)
          ~ revision       = 1 -> (known after apply)
          ~ values         = jsonencode(
                {
                  - configs      = {
                      - cm           = {
                          - "admin.enabled"                = "true"
                          - "application.instanceLabelKey" = "app.kubernetes.io/instance"
                          - "timeout.reconciliation"       = "60s"
                        }
                      - repositories = {
                          - git  = {
                              - name          = "faspo-apps"
                              - sshPrivateKey = <<-EOT
                                    -----BEGIN OPENSSH PRIVATE KEY-----
                                    b3BlbnNzaC1rZXktdjEAAAAABG5vbmUAAAAEbm9uZQAAAAAAAAABAAAAMwAAAAtzc2gtZW
                                    QyNTUxOQAAACAXzCAwKb/wrGzSdRKJauDJCB6a6+TKIY2q3/qSjWqlnAAAAJjULzJD1C8y
                                    QwAAAAtzc2gtZWQyNTUxOQAAACAXzCAwKb/wrGzSdRKJauDJCB6a6+TKIY2q3/qSjWqlnA
                                    AAAEDsqBI3dSzNnX2idmN+Kh4FVYN0erJKB3aHjhVa1NqsbRfMIDApv/CsbNJ1Eolq4MkI
                                    Hprr5Mohjarf+pKNaqWcAAAAEnNjb3Jpbmctc3lzdGVtLXBvYwECAw==
                                    -----END OPENSSH PRIVATE KEY-----
                                EOT
                              - type          = "git"
                              - url           = "git@github.com:scoring-system-poc/faspo-apps.git"
                            }
                          - helm = {
                              - enableOCI = "true"
                              - name      = "faspopocacr"
                              - password  = "QYWDM6VTKTEduAp9vxEhB6dTUZc3eNVr7fEPw5+Zqx+ACRCHiAJW"
                              - type      = "helm"
                              - url       = "oci://faspopocacr.azurecr.io/helm"
                              - username  = "argocd"
                            }
                        }
                    }
                  - crds         = {
                      - additionalLabels = {
                          - "argocd.argoproj.io/managed-by" = "faspo-poc-argocd"
                        }
                    }
                  - extraObjects = [
                      - {
                          - apiVersion = "argoproj.io/v1alpha1"
                          - kind       = "Application"
                          - metadata   = {
                              - finalizers = [
                                  - "resources-finalizer.argocd.argoproj.io",
                                ]
                              - name       = "faspo-apps"
                              - namespace  = "faspo-poc-argocd"
                            }
                          - spec       = {
                              - destination = {
                                  - namespace = "faspo-poc-argocd"
                                  - server    = "https://kubernetes.default.svc"
                                }
                              - project     = "default"
                              - source      = {
                                  - path           = "."
                                  - repoURL        = "git@github.com:scoring-system-poc/faspo-apps.git"
                                  - targetRevision = "env/poc"
                                }
                              - syncPolicy  = {
                                  - automated = {
                                      - prune    = true
                                      - selfHeal = true
                                    }
                                }
                            }
                        },
                    ]
                }
            ) -> (known after apply)
          ~ version        = "7.8.23" -> (known after apply)
        } -> (known after apply)
        name                       = "faspo-poc-argocd"
      ~ values                     = [
          ~ (sensitive value),
        ]
        # (27 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```
